# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Install Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gh'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'zsh'
brew 'zsh-completions'
brew 'neovim'
brew 'vim'
brew 'wget'
brew 'node'
brew 'yarn'
brew 'unrar'
brew 'tmux'
brew 'python3'
brew 'go'
brew 'gnupg'
brew 'iterm2'
brew 'Rectangle'

# Apps
cask 'google-chrome'
cask 'zoom'
cask 'fontforge'
cask 'git-credential-manager-core'

# Fonts
cask 'font-monofur-for-powerline'
cask 'font-source-code-pro-for-powerline'

# Install Mac App Store apps
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'affinity-photo', id: 824183456
mas '/affinity-designer', id: 824171161
mas '/xcode', id: 497799835
